# Core
brew "stow"
brew "mise"
brew "starship"

# Shell extras
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "zoxide"

# Multiplexer & editor
brew "tmux"
brew "neovim"

# macOS notifications (used by ~/.claude/hooks/notify.sh)
brew "terminal-notifier"

# Modern CLI replacements
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "git-delta"
brew "jq"
brew "yq"
brew "tree"
brew "btop"

# Git
brew "git"
brew "gh"
brew "lazygit"
brew "lefthook"

# Language servers (used by Claude Code LSP plugins)
brew "gopls"
brew "typescript-language-server"
brew "ruby-lsp"

# GUI apps
cask "alacritty"
cask "raycast"

# Font
cask "font-jetbrains-mono-nerd-font"
