# Core
brew "stow"
brew "mise"
brew "starship"
brew "uv"               # Python runner; installs semble and runs its MCP via uvx

# Shell extras
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "fzf-tab"          # tab completion through fzf, with previews
brew "zoxide"
brew "atuin"            # shell history: SQLite store + Ctrl-R fuzzy TUI

# Multiplexer & editor
brew "tmux"
brew "sesh"             # zoxide-aware tmux session manager (prefix + f)
brew "neovim"
brew "tree-sitter-cli"  # nvim-treesitter (main branch) compiles parsers with it

# Modern CLI replacements
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "git-delta"
brew "jq"
brew "yq"
brew "tree"
brew "btop"
brew "yazi"             # terminal file manager (shell wrapper `y` cds on exit)
brew "dust"             # du, tree view of disk hogs
brew "duf"              # df, readable mount table
brew "sd"               # sed for find/replace with sane regex
brew "hyperfine"        # statistical benchmarking (used by `make check`)
brew "xh"               # HTTPie-syntax curl replacement
brew "glow"             # render markdown in the terminal

# Git
brew "git"
brew "gh"
brew "lazygit"
brew "lefthook"
brew "git-absorb"       # staged fixes -> fixup! commits for rebase --autosquash
brew "difftastic"       # AST-aware structural diff; see `git dft` alias
brew "jj"               # jujutsu — git-compatible VCS worth trialing per repo

# Shell lint (local + CI parity)
brew "shellcheck"
brew "shfmt"

# jdx / en.dev toolchain (adoption order: mise -> hk -> aube -> pitchfork -> fnox)
# brew "hk"             # parallel git hooks (pkl config); overlaps lefthook — keep one
brew "aube"             # Node pkg manager with supply-chain gates; agent-install safety
# brew "pitchfork"      # daemon manager ("nicer foreman") — add on real need
# brew "fnox"           # secrets manager — add if per-project secrets get messy

# Language servers (used by Claude Code LSP plugins)
brew "gopls"
brew "typescript-language-server"
brew "ruby-lsp"

# GUI apps
cask "alacritty"
cask "raycast"

# Font
cask "font-jetbrains-mono-nerd-font"
